Revit 2020 API
ElectricalEquipment Properties
The ElectricalEquipment type exposes the following members.
Properties
Name | Description
AssignedElectricalSystems
Retrieves the electrical systems this electrical panel currently is assigned to.
 (Inherited from MEPModel.)
ConnectorManager
Retrieves the Connector Manager from this MEPModel.
 (Inherited from MEPModel.)
DistributionSystem
get or set the Distribution System for the Electrical Equipment.
ElectricalSystems
Retrieves the electrical systems that are currently created using this MEPModel.
 (Inherited from MEPModel.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace